of60/tutorials/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform ( 1 0 0 );
    }

    outlet
    {
        type            zeroGradient;
    }

    "(walls|cylinder)"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
     
    }
    
    frontAndBack
    {
        type           empty;
    }
    
}

// ************************************************************************* //
