of60/tutorials/cylinder/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{

	type          	PTTexp;
	elastEnergDiss	elastEnergDiss [0 0 0 0 0 0 0] 1;  // 1-fully entropic
	epsilon 	epsilon  [0 0  0 0 0 0 0]	0.1;
	zeta 		zeta 	[0  0  0 0 0 0 0]	0.;
	rho		rho	[1 -3  0 0 0 0 0]	921.;
	etaS		etaS	[1 -1 -1 0 0 0 0]	3e-4;  // acetone
	etaP		etaP	[1 -1 -1 0 0 0 0]	1e+4;  // polystyrene melt
	lambda		lambda	[0  0  1 0 0 0 0]	0.1;

	stabilization	coupling;

}

thermophysicalProperties {
	T0              T0 [0 0 0 1 0 0 0] 462.;

	etaSThermFun	constant;
	etaSThermFunCoefficients {
	  etaS0		etaS0 [1 -1 -1 0 0 0 0] 3e-4;  //yes, we have to repeat it :(
	};
	
	etaPThermFun    WLF;
	etaPThermFunCoefficients {
	  etaP0		etaP0	[1 -1 -1 0 0 0 0]	1e+4;
	  c1		c1	[0  0  0 0 0 0 0]	4.54;
	  c2		c2	[0  0  0 1 0 0 0]	150.36;
	};

	lambdaThermFun    WLF;
	lambdaThermFunCoefficients {
	  lambda0	lambda0	[0  0  1 0 0 0 0]	0.1;
	  c1		c1	[0  0  0 0 0 0 0]	4.54;
	  c2		c2	[0  0  0 1 0 0 0]	150.36;
	};

	cpThermFun	constant;
	cpThermFunCoefficients {
	  cp0		cp0	[0 2 -2 -1 0 0 0]	1.5e3;
	};

	ktThermFun	constant;
	ktThermFunCoefficients {
	  kt0		kt0	[1 1 -3 -1 0 0 0]	0.17;
	};
}

passiveScalarProperties
{
                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
